In [ ]:
import pandas as pd
import numpy as np
from IPython.display import Image
import matplotlib.pyplot as plt

In [ ]:
s1=pd.read_csv("skill7.1.csv")
s1.head()

   Sl. No Name  SSN NO Country  Bodytemp_usa  Height_usa(feet)
0       1    x  12us01     USA          97.2               6.4
1       2    y  12us02     USA          97.4               6.5
2       3    z  12us03     USA          98.5               6.2
3       4    p  12us04     USA          98.6               5.9
4       5    q  12us05     USA          97.8               5.8

In [ ]:
s2=pd.read_csv("skill7.2.csv")
s2.head()

   Sl. No Name   SSN NO Country  Bodytemp_india  Height_ind(Feet)
0       1    A  15ind01     IND            98.4               5.8
1       2    B  15ind02     IND            98.4               5.7
2       3    C  15ind03     IND            97.8               5.5
3       4    D  15ind04     IND            98.6               5.4
4       5    E  15ind05     IND            97.8               5.6

In [ ]:
print(s1.var()['Bodytemp_usa'])#Variance of body temp of USA

0.5511111111111116

In [ ]:
print(s2.var()['Bodytemp_india'])#Variance of body temp of INDIA

0.26711111111110974

In [ ]:
sum1  = s1['Bodytemp_usa'] + s2['Bodytemp_india'] #Variance of sum of body temp of 2 countries
print(sum1.var())

1.227111111111105

In [ ]:
print(s1.var()['Height_usa(feet)'])#Variance of height of USA

0.2308988888888888

In [ ]:
print(s2.var()['Height_ind(Feet)'])#Variance of height of INDIA

0.10933333333333334

In [ ]:
sum2  = s1['Height_usa(feet)'] + s2['Height_ind(Feet)'] #Variance of sum height of 2 countries
sum2.var()

0.18369888888888872

In [ ]:
#1B
b=pd.read_csv("Iris.csv")
b

      Id  SepalLengthCm  ...  PetalWidthCm         Species
0      1            5.1  ...           0.2     Iris-setosa
1      2            4.9  ...           0.2     Iris-setosa
2      3            4.7  ...           0.2     Iris-setosa
3      4            4.6  ...           0.2     Iris-setosa
4      5            5.0  ...           0.2     Iris-setosa
..   ...            ...  ...           ...             ...
145  146            6.7  ...           2.3  Iris-virginica
146  147            6.3  ...           1.9  Iris-virginica
147  148            6.5  ...           2.0  Iris-virginica
148  149            6.2  ...           2.3  Iris-virginica
149  150            5.9  ...           1.8  Iris-virginica

[150 rows x 6 columns]

In [ ]:
print(b.var()['SepalLengthCm'])#variance of sepal lengthcm

0.6856935123042505

In [ ]:
print(b.var()['SepalWidthCm'])#variance of sepal widthcm

0.18800402684563763

In [ ]:
sum3=b['SepalLengthCm']+b['SepalWidthCm']#variance of sumof sepallengththcm and sepalwidhtcm
sum3.var()

0.7951606263982107